def test(data):
    print(f"我是test函数，我收到的参数是{data}")

list1 = [100,200,300,400]
tuple1 = ("你好","北京","尚硅谷")

# 函数调用时，正常的传递列表或元组
test(list1)
test(tuple1)

# 函数调用时，使用*对：列表 或 元组进行解包后，再传递参数
def test1(a,b,c,d):
    print(f"我是test1函数，我收到的参数是：{a}，{b}，{c}，{d}")

def test2(a,b,c):
    print(f"我是test2函数，我收到的参数是：{a}，{b}，{c}")

test1(*list1)   # 这里的 * 将列表拆分为4个参数，将元素暴露出来，这就是解包
test2(*tuple1)  # 这里的 * 将元组拆分为3个参数，将元素暴露出来，这就是解包

# 改良后的方法，这个形参列表中的 * 作用是声明该参数为可变参数，可变参数会被打包为元组
def test3(*args):
    print(args)

test3(100,200,300,400)  # (100, 200, 300, 400)
test3("你好","北京","尚硅谷")  # ('你好', '北京', '尚硅谷')
test3(*list1)   # (100, 200, 300, 400)      test3(*list1)与 test3(100,200,300,400)的作用一样
test3(*tuple1)  # ('你好', '北京', '尚硅谷')

# 我们比较一下解包前后的打印
print(list1)   # [100, 200, 300, 400]
print(*list1)   # 100 200 300 400
print(100,200,300,400)  #100 200 300 400
print(tuple1)   # ('你好', '北京', '尚硅谷')
print(*tuple1)   # 你好 北京 尚硅谷
print("你好","北京","尚硅谷")   # 你好 北京 尚硅谷