# 1. 对列表进行切片
list1 = [1,2,3,4,5,6,7,8,9,10]
print(list1[1:6:1]) # [2, 3, 4, 5, 6]
print(list1[1:6:2]) # [2, 4, 6]
print(list1[1:6:3]) # [2, 5]
print(list1[::]) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list1[0:len(list1):1]) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list1[:999:]) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list1[7:2:-1]) # [8, 7, 6, 5, 4]
print(list1[7:2:1]) # []
# 一个特殊情况：当同时省略起始位置索引和结束索引时，如果步长为负数，Python就会自动对调起始位置和结束位置
print(list1[::-1])  # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

# 2. 对元组进行切片
tuple1 = (1,2,3,4,5,6,7,8,9,10)
print(tuple1[0:5:1])    # (1, 2, 3, 4, 5)

# 对字符串进行切片
msg1 = "welcome to atguigu"
print(msg1[0:5:1])  # welco