# 1. 增
# 1.1 add 方法，向集合中添加元素
s1 = {10,20,30,40,50}
s1.add(60)
print(s1)   # {50, 20, 40, 10, 60, 30}
# 1.2 update 方法：向集合中添加元素（必须传递可迭代对象，例如：列表、元组、集合等）
s2 = {10,20,30,40,50}
s2.update([60,70])
print(s2)   # {50, 20, 70, 40, 10, 60, 30}
s2.update((80,90))
print(s2)   # {70, 10, 80, 20, 90, 30, 40, 50, 60}
s2.update("abc")
print(s2)   # {70, 10, 80, 20, 'a', 90, 30, 'b', 40, 50, 60, 'c'}
s2.update({100,110})
print(s2)   # {70, 10, 80, 20, 'a', 90, 30, 'b', 100, 40, 110, 50, 60, 'c'}

# 2. 删除
# 2.1 remove 方法：从集合中以处指定元素（若元素不存在，会报错）,无返回值
s3 = {10,20,30,40,50}
s3.remove(20)
print(s3)   # {50, 40, 10, 30}
# s3.remove(60)   # KeyError: 60
# 2.2 discard 方法：从集合中移除指定元素，（若元素不存在，不报错），无返回值
s4 =  {10,20,30,40,50}
s4.discard(10)
s4.discard(60)
print(s4)   # {50, 20, 40, 30}
# 2.3 pop 方法：从集合中随机移除任意一个元素，返回值：移除的那个元素
s5 =  {10,20,30,40,50}
print(s5.pop()) # 50
print(s5)   # {20, 40, 10, 30}
print(s5.pop()) # 20
print(s5)   # {40, 10, 30}
# 2.4 clear 方法：清空集合
s6 =  {10,20,30,40,50}
s6.clear()
print(s6)   # set()
s7 = set()
print(s7)   # set()

# 3. 修改
# 集合没有下标，也不支持replace方法，所以集合没有专门用于“改”的方法
# 可以用：remove + add的组合，来达到“修改”的效果
s8 =  {10,20,30,40,50}
s8.remove(10)
s8.add(60)
print(s8)   # {50, 20, 40, 60, 30}

# 4. 查
# 由于集合没有下标，也不支持切片操作，所以集合不具备按位置访问的能力。
# 后面我们会讲到成员运算符
# 这里先提前感受一下成员运算符
s9 =  {10,20,30,40,50}
print(20 in s9) # True
print(20 not in s9) # False
print(60 not in s9) # True