# 1. 查询
d1 = {'张三': 99, '李四': 98, '王五': 97}
# 1.1 直接取值，key不存在会报错
print(d1["张三"])  # 99
# print(d1["奥特曼"])    # KeyError: '奥特曼'
# 1.2 安全取值，若key不存在，会返回默认值（若没有设置默认值，返回None）
print(d1.get("奥特曼"))  # None
print(d1.get("奥特曼", "key不存在"))  # key不存在
print(d1.get("张三"))  # 99
print(dict.get(d1, "张三"))  # 99

# 2. 新增
d2 = {'张三': 99, '李四': 98, '王五': 97}
d2["赵六"] = 100
print(d2)  # {'张三': 99, '李四': 98, '王五': 97, '赵六': 100}

# 3. 修改
# 3.1 单个修改，与新增的写法一样，规则：若字典中存在这个key，就是修改；否则，就是新增
d3 = {'张三': 99, '李四': 98, '王五': 97}
d3['张三'] = 98
print(d3)   # {'张三': 98, '李四': 98, '王五': 97}
# 3.3 批量修改，如果当前字典中不存在某个key，会新增
d4 =  {'张三': 99, '李四': 98, '王五': 97}
d4.update({"张三":100,"李四":100,"赵六":100})
print(d4)

# 4. 删除
# 4.1 使用 del 关键字删除，无返回值
d5 =  {'张三': 99, '李四': 98, '王五': 97}
del d5['张三']
print(d5)   # {'李四': 98, '王五': 97}
# 4.2 使用pop方法删除，删除的key不存在时会报错，使用默认值时，当
d6 = {'张三': 99, '李四': 98, '王五': 97}
print(d6.pop('张三')) # 99
print(d6)   # {'李四': 98, '王五': 97}
# d6.pop("奥特曼")   # KeyError: '奥特曼'
print(d6.pop("奥特曼","key不存在"))   # key不存在

# 5. 清空字典
d6 = {'张三': 99, '李四': 98, '王五': 97}
d6.clear()
print(d6)   # {}