# 以下这五个函数：既能定义对应的【空容器】，又能将【其他类型】转换为对应的数据类型

# 1. list函数，① 定义空列表。 ②将【可迭代对象】转换为列表
print(list(range(8)))   # [0, 1, 2, 3, 4, 5, 6, 7]
print(list([1,2,3]))   # [1, 2, 3]
print(list("你好啊"))     # ['你', '好', '啊']
print(list((10,20,30)))     #[10, 20, 30]
print(list({10,20,30}))     # [10, 20, 30]
print(list({'张三': 99, '李四': 98, '王五': 97}))     # ['张三', '李四', '王五']
print(list({'张三': 99, '李四': 98, '王五': 97}.values()))     # [99, 98, 97]
print(list({'张三': 99, '李四': 98, '王五': 97}.items()))     # [('张三', 99), ('李四', 98), ('王五', 97)]

# 2. tuple函数，① 定义空元组。 ②将【可迭代对象】转换为元组
print( tuple(range(8)))   # (0, 1, 2, 3, 4, 5, 6, 7)
print( tuple([1,2,3]))   # (1, 2, 3)
print( tuple("你好啊"))     # ('你', '好', '啊')
print( tuple((10,20,30)))     #(10, 20, 30)
print( tuple({10,20,30}))     # (10, 20, 30)
print( tuple({'张三': 99, '李四': 98, '王五': 97}))     # ('张三', '李四', '王五')
print( tuple({'张三': 99, '李四': 98, '王五': 97}.values()))     # (99, 98, 97)
print( tuple({'张三': 99, '李四': 98, '王五': 97}.items()))     # (('张三', 99), ('李四', 98), ('王五', 97))

# 3. set函数，① 定义空集合。 ②将【可迭代对象】转换为集合
print( set(range(8)))   # {0, 1, 2, 3, 4, 5, 6, 7}
print( set([1,2,3]))   # {1, 2, 3}
print( set("你好啊"))     # {'好', '你', '啊'}
print( set((10,20,30)))     # {10, 20, 30}
print( set({10,20,30}))     # {10, 20, 30}
print( set({'张三': 99, '李四': 98, '王五': 97}))     # {'李四', '张三', '王五'}
print( set({'张三': 99, '李四': 98, '王五': 97}.values()))     # {97, 98, 99}
print( set({'张三': 99, '李四': 98, '王五': 97}.items()))     # {('王五', 97), ('张三', 99), ('李四', 98)}

# 4. str函数，① 定义空字符串。 ②将【任意类型】转换为字符串
s1 = str(range(8))
s2 = str([1,2,3])
s3 = str("你好啊")
s4 = str((10,20,30))
s5 = str({10,20,30})
s6 = str({'张三': 99, '李四': 98, '王五': 97})
s7 = str({'张三': 99, '李四': 98, '王五': 97}.values())
s8 = str({'张三': 99, '李四': 98, '王五': 97}.items())
print(type(s1),s1 )   # <class 'str'> range(0, 8)
print(type(s2),s2 )   # <class 'str'> [1, 2, 3]
print(type(s3),s3 )   # <class 'str'> 你好啊
print(type(s4),s4 )   # <class 'str'> (10, 20, 30)
print(type(s5),s5 )   # <class 'str'> {10, 20, 30}
print(type(s6),s6 )   # <class 'str'> {'张三': 99, '李四': 98, '王五': 97}
print(type(s7),s7 )   # <class 'str'> dict_values([99, 98, 97])
print(type(s8),s8 )   # <class 'str'> dict_items([('张三', 99), ('李四', 98), ('王五', 97)])

# 5. dict函数，① 定义空字典。 ②将【可迭代对象】转换为字典
# 备注： 交给dict函数的内容必须是键值对才行，否则会报错
print(dict({'张三': 99, '李四': 98, '王五': 97})) # {'张三': 99, '李四': 98, '王五': 97}
print(dict([['张三', 99],['李四',98],['王五',97]])) # {'张三': 99, '李四': 98, '王五': 97}
print(dict((['张三', 99],['李四',98],['王五',97]))) # {'张三': 99, '李四': 98, '王五': 97}
print(dict([('张三', 99),('李四',98),('王五',97)])) # {'张三': 99, '李四': 98, '王五': 97}
print(dict(['张三','李四','王五'])) # {'张': '三', '李': '四', '王': '五'}
# print(dict(['张三11','李四22','王五33'])) # ValueError: dictionary update sequence element #0 has length 4; 2 is required
print(dict([{'张三', 99},{'李四',98},{'王五',97}])) # {99: '张三', 98: '李四', 97: '王五'}


# 6. 所有的数据容器，都支持【成员运算符】：in 和not in 作用：判断某个“元素”是否存在于容器中